Repository: PierreHunout/convert-to-webp-lite
Catalog: languages/wp-convert-to-webp-*.po
Languages: fr_fr, pt_pt

source: Convert to WebP
fr_fr: Convertir en WebP
pt_pt: Converter para WebP

source: Automatically convert images to WebP format upon upload in WordPress. Improve website performance with optimized images.
pt_pt: Converta automaticamente as imagens para o formato WebP após o upload no WordPress. Melhore o desempenho do seu website com imagens otimizadas.

source: Access denied.
fr_fr: Accès refusé.
pt_pt: Acesso negado.

source: Invalid attachment ID.
fr_fr: ID de pièce jointe invalide.
pt_pt: ID de anexo inválido.

source: Done
fr_fr: Terminé
pt_pt: Concluído

source: Not allowed
fr_fr: Non autorisé
pt_pt: Não permitido

source: No files found to process.
fr_fr: Aucun fichier à traiter.
pt_pt: Nenhum ficheiro encontrado para processar.

source: Deleted WebP files
fr_fr: Fichiers WebP supprimés
pt_pt: Ficheiros WebP eliminados

source: WebP Conversion
fr_fr: Conversion WebP
pt_pt: Conversão WebP

source: Manage WebP Conversion
fr_fr: Gérer la conversion WebP
pt_pt: Gerir conversão WebP

source: WebP Quality
fr_fr: Qualité WebP
pt_pt: Qualidade WebP

source: Higher means better quality but larger files.
fr_fr: Plus élevé signifie meilleure qualité mais fichiers plus volumineux.
pt_pt: Maior significa melhor qualidade mas ficheiros maiores.

source: Replace mode
fr_fr: Mode de remplacement
pt_pt: Modo de substituição

source: Enable replacement of <strong>&#60;img&#62;</strong> tags with <strong>&#60;picture&#62;</strong> tags.
fr_fr: Activer le remplacement des balises <strong>&#60;img&#62;</strong> par des balises <strong>&#60;picture&#62;</strong>.
pt_pt: Ativar a substituição de tags <strong>&#60;img&#62;</strong> por tags <strong>&#60;picture&#62;</strong>.

source: Use <strong>&#60;picture&#62;</strong> tags
fr_fr: Utiliser les balises <strong>&#60;picture&#62;</strong>
pt_pt: Usar tags <strong>&#60;picture&#62;</strong>

source: If enabled, all images will be replaced by their WebP versions inside the <strong>&#60;picture&#62;</strong> tags. Otherwise, the original <strong>&#60;img&#62;</strong> tags will be used.
fr_fr: Si activé, toutes les images seront remplacées par leurs versions WebP dans les balises <strong>&#60;picture&#62;</strong>. Sinon, les balises <strong>&#60;img&#62;</strong> originales seront utilisées.
pt_pt: Se ativado, todas as imagens serão substituídas pelas suas versões WebP dentro das tags <strong>&#60;picture&#62;</strong>. Caso contrário, as tags <strong>&#60;img&#62;</strong> originais serão usadas.

source: Debug mode
fr_fr: Mode débogage
pt_pt: Modo de depuração

source: Enable debug mode to log additional information during the conversion/deletion process.
fr_fr: Activer le mode débogage pour enregistrer des informations supplémentaires pendant le processus de conversion/suppression.
pt_pt: Ativar o modo de depuração para registar informações adicionais durante o processo de conversão/eliminação.

source: Enable debug logging
fr_fr: Activer la journalisation du débogage
pt_pt: Ativar registo de depuração

source: Logs can be viewed in the <code>convert-to-webp-logs</code> folder, in your <code>wp-content</code> folder.
fr_fr: Les journaux peuvent être consultés dans le dossier <code>convert-to-webp-logs</code>, dans votre dossier <code>wp-content</code>.
pt_pt: Os registos podem ser visualizados na pasta <code>convert-to-webp-logs</code>, na sua pasta <code>wp-content</code>.

source: Clean data on <strong>deactivate</strong>
fr_fr: Nettoyer les données lors de la <strong>désactivation</strong>
pt_pt: Limpar dados ao <strong>desativar</strong>

source: Delete WebP files and options
fr_fr: Supprimer les fichiers WebP et les options
pt_pt: Eliminar ficheiros WebP e opções

source: Clean data on <strong>uninstall</strong>
fr_fr: Nettoyer les données lors de la <strong>désinstallation</strong>
pt_pt: Limpar dados ao <strong>desinstalar</strong>

source: Save options
fr_fr: Enregistrer les options
pt_pt: Guardar opções

source: Convert old images
fr_fr: Convertir les anciennes images
pt_pt: Converter imagens antigas

source: This will convert all existing images in your media library to WebP format. New images will be converted automatically upon upload.
fr_fr: Ceci convertira toutes les images existantes de votre bibliothèque de médias au format WebP. Les nouvelles images seront automatiquement converties lors du téléchargement.
pt_pt: Isto irá converter todas as imagens existentes na sua biblioteca de multimédia para o formato WebP. As novas imagens serão convertidas automaticamente ao serem carregadas.

source: Convert previously uploaded images
fr_fr: Convertir les images téléchargées précédemment
pt_pt: Converter imagens carregadas anteriormente

source: Are you sure you want to delete all WebP files?
fr_fr: Êtes-vous sûr de vouloir supprimer tous les fichiers WebP ?
pt_pt: Tem a certeza de que deseja eliminar todos os ficheiros WebP?

source: Delete all WebP files
fr_fr: Supprimer tous les fichiers WebP
pt_pt: Eliminar todos os ficheiros WebP

source: Select an Image for Comparison
fr_fr: Sélectionner une image pour comparaison
pt_pt: Selecionar uma imagem para comparação

source: Select Image
fr_fr: Sélectionner l'image
pt_pt: Selecionar imagem

source: Conversion Progress
fr_fr: Progression de la conversion
pt_pt: Progresso da conversão

source: Close
fr_fr: Fermer
pt_pt: Fechar

source: Options saved successfully.
fr_fr: Options enregistrées avec succès.
pt_pt: Opções guardadas com sucesso.

source: Invalid attachment ID provided.
fr_fr: ID de pièce jointe fourni invalide.
pt_pt: ID de anexo fornecido inválido.

source: Invalid metadata provided.
fr_fr: Métadonnées fournies invalides.
pt_pt: Metadados fornecidos inválidos.

source: Failed to initialize WordPress filesystem.
fr_fr: Échec de l'initialisation du système de fichiers WordPress.
pt_pt: Falha ao inicializar o sistema de ficheiros do WordPress.

source: File does not exist for attachment ID: %s
fr_fr: Le fichier n'existe pas pour l'ID de pièce jointe : %s
pt_pt: O ficheiro não existe para o ID de anexo: %s

source: File is not writable: %s
fr_fr: Le fichier n'est pas accessible en écriture : %s
pt_pt: O ficheiro não tem permissão de escrita: %s

source: [WP Convert to WebP] Invalid argument in deletion preparation: %s
fr_fr: [WP Convert to WebP] Argument invalide dans la préparation de suppression : %s
pt_pt: [WP Convert to WebP] Argumento inválido na preparação de eliminação: %s

source: [WP Convert to WebP] Runtime error in deletion preparation: %s
fr_fr: [WP Convert to WebP] Erreur d'exécution dans la préparation de suppression : %s
pt_pt: [WP Convert to WebP] Erro de execução na preparação de eliminação: %s

source: [WP Convert to WebP] Unexpected error preparing deletion: %1$s in %2$s on line %3$d
fr_fr: [WP Convert to WebP] Erreur inattendue lors de la préparation de suppression : %1$s dans %2$s à la ligne %3$d
pt_pt: [WP Convert to WebP] Erro inesperado ao preparar eliminação: %1$s em %2$s na linha %3$d

source: Invalid file path provided.
fr_fr: Chemin de fichier fourni invalide.
pt_pt: Caminho de ficheiro fornecido inválido.

source: File does not exist: %s
fr_fr: Le fichier n'existe pas : %s
pt_pt: O ficheiro não existe: %s

source: Unable to parse file path: %s
fr_fr: Impossible d'analyser le chemin du fichier : %s
pt_pt: Não foi possível analisar o caminho do ficheiro: %s

source: File is already a WebP file, nothing to delete: %s
fr_fr: Le fichier est déjà un fichier WebP, rien à supprimer : %s
pt_pt: O ficheiro já é um ficheiro WebP, nada para eliminar: %s

source: Unsupported file type: %s
fr_fr: Type de fichier non pris en charge : %s
pt_pt: Tipo de ficheiro não suportado: %s

source: WebP file does not exist, nothing to delete: %s
fr_fr: Le fichier WebP n'existe pas, rien à supprimer : %s
pt_pt: O ficheiro WebP não existe, nada para eliminar: %s

source: WebP file is not writable: %s
fr_fr: Le fichier WebP n'est pas accessible en écriture : %s
pt_pt: O ficheiro WebP não tem permissão de escrita: %s

source: Failed to delete WebP file: %s
fr_fr: Échec de la suppression du fichier WebP : %s
pt_pt: Falha ao eliminar o ficheiro WebP: %s

source: Successfully deleted WebP file: %s
fr_fr: Fichier WebP supprimé avec succès : %s
pt_pt: Ficheiro WebP eliminado com sucesso: %s

source: [WP Convert to WebP] Invalid argument in WebP deletion: %s
fr_fr: [WP Convert to WebP] Argument invalide dans la suppression WebP : %s
pt_pt: [WP Convert to WebP] Argumento inválido na eliminação WebP: %s

source: [WP Convert to WebP] Runtime error in WebP deletion: %s
fr_fr: [WP Convert to WebP] Erreur d'exécution dans la suppression WebP : %s
pt_pt: [WP Convert to WebP] Erro de execução na eliminação WebP: %s

source: [WP Convert to WebP] Unexpected error deleting WebP file: %1$s in %2$s on line %3$d
fr_fr: [WP Convert to WebP] Erreur inattendue lors de la suppression du fichier WebP : %1$s dans %2$s à la ligne %3$d
pt_pt: [WP Convert to WebP] Erro inesperado ao eliminar ficheiro WebP: %1$s em %2$s na linha %3$d

source: [WP Convert to WebP] Invalid argument in conversion preparation: %s
fr_fr: [WP Convert to WebP] Argument invalide dans la préparation de conversion : %s
pt_pt: [WP Convert to WebP] Argumento inválido na preparação de conversão: %s

source: [WP Convert to WebP] Runtime error in conversion preparation: %s
fr_fr: [WP Convert to WebP] Erreur d'exécution dans la préparation de conversion : %s
pt_pt: [WP Convert to WebP] Erro de execução na preparação de conversão: %s

source: [WP Convert to WebP] Unexpected error preparing conversion: %1$s in %2$s on line %3$d
fr_fr: [WP Convert to WebP] Erreur inattendue lors de la préparation de conversion : %1$s dans %2$s à la ligne %3$d
pt_pt: [WP Convert to WebP] Erro inesperado ao preparar conversão: %1$s em %2$s na linha %3$d

source: The original file is already a WebP file: %s
fr_fr: Le fichier original est déjà un fichier WebP : %s
pt_pt: O ficheiro original já é um ficheiro WebP: %s

source: WebP file already exists: %s
fr_fr: Le fichier WebP existe déjà : %s
pt_pt: O ficheiro WebP já existe: %s

source: Failed to create image resource: %s
fr_fr: Échec de la création de la ressource image : %s
pt_pt: Falha ao criar recurso de imagem: %s

source: Successfully converted: %s
fr_fr: Converti avec succès : %s
pt_pt: Convertido com sucesso: %s

source: Failed to save WebP file: %s
fr_fr: Échec de l'enregistrement du fichier WebP : %s
pt_pt: Falha ao guardar o ficheiro WebP: %s

source: [WP Convert to WebP] Invalid argument in file conversion: %s
fr_fr: [WP Convert to WebP] Argument invalide dans la conversion du fichier : %s
pt_pt: [WP Convert to WebP] Argumento inválido na conversão do ficheiro: %s

source: [WP Convert to WebP] Runtime error in file conversion: %s
fr_fr: [WP Convert to WebP] Erreur d'exécution dans la conversion du fichier : %s
pt_pt: [WP Convert to WebP] Erro de execução na conversão do ficheiro: %s

source: [WP Convert to WebP] Unexpected error converting file: %1$s in %2$s on line %3$d
fr_fr: [WP Convert to WebP] Erreur inattendue lors de la conversion du fichier : %1$s dans %2$s à la ligne %3$d
pt_pt: [WP Convert to WebP] Erro inesperado ao converter ficheiro: %1$s em %2$s na linha %3$d

source: The folder at %s does not exist
fr_fr: Le dossier %s n'existe pas
pt_pt: A pasta em %s não existe

source: Unable to resolve includes directory path
fr_fr: Impossible de résoudre le chemin du répertoire includes
pt_pt: Não foi possível resolver o caminho da pasta includes

source: [WP Convert to WebP] Error running %1$s: %2$s in %3$s on line %4$d
fr_fr: [WP Convert to WebP] Erreur lors de l'exécution de %1$s : %2$s dans %3$s à la ligne %4$d
pt_pt: [WP Convert to WebP] Erro ao executar %1$s: %2$s em %3$s na linha %4$d

source: [WP Convert to WebP] Error in autoload(): %1$s in %2$s on line %3$d
pt_pt: [WP Convert to WebP] Erro em autoload(): %1$s em %2$s na linha %3$d

source: Settings
pt_pt: Configurações

source: Convert images to WebP format for better performance.
fr_fr: Convertit les images au format WebP pour de meilleures performances.

source: [WP Convert to WebP] Error in run_files(): %1$s in %2$s on line %3$d
fr_fr: [WP Convert to WebP] Erreur dans run_files() : %1$s dans %2$s à la ligne %3$d
